/*
* Класс GPoint, наследуется от класса GPrimitive и реализует
* метод paint для рисования точки.
*/
//---------------------------------------------------------------------------

#ifndef GPointH
#define GPointH

#include "GPrimitive.h"

class GPoint : public GPrimitive
{
    public:
		// Конструктор
        GPoint(TForm* f);
		// Деструктор
        ~GPoint();
		// Реализуемый метод рисования родительского класса
        void paint();
};

//---------------------------------------------------------------------------
#endif
